# Шаг 1: Берем за основу официальный легкий образ Python
FROM python:3.12-slim

# Шаг 2: Указываем рабочую директорию внутри контейнера
WORKDIR /app

# Шаг 3: Копируем список зависимостей в контейнер
COPY requirements.txt .

# Шаг 4: Устанавливаем библиотеки
RUN pip install --no-cache-dir -r requirements.txt

# Шаг 5: Копируем весь остальной код проекта
COPY . .

# Шаг 6: Создаем папку для сохранения данных
RUN mkdir -p /data

# Шаг 7: Открываем порт 5000 наружу
EXPOSE 5000

# Шаг 8: Команда при запуске контейнера
CMD ["python", "app.py"]